Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: The native Gettext support in PHP is buggy and often missing on Windows builds, it is recommended to use third party library `motranslator <https://github.com/phpmyadmin/motranslator>`_ instead.
sv: Det inbyggda Gettext-stÃ¶det i PHP Ã¤r buggigt och saknas ofta i Windows-versioner. Det rekommenderas dÃ¤rfÃ¶r att istÃ¤llet anvÃ¤nda tredjepartsbiblioteket `motranslator <https://github.com/phpmyadmin/motranslator>`_.

source: You can also use :ref:`javaprop` if plurals are not needed.
sv: Du kan ocksÃ¥ anvÃ¤nda :ref:`javaprop` om pluralformer inte behÃ¶vs.

source: You can also use plain :ref:`json` if plurals are not needed.
sv: Du kan ocksÃ¥ anvÃ¤nda vanlig :ref:`json` om pluralformer inte behÃ¶vs.

source: The more detailed workflow for some formats is described in following chapters:
sv: Det mer detaljerade arbetsflÃ¶det fÃ¶r vissa format beskrivs i fÃ¶ljande kapitel:

source: Success stories
sv: FramgÃ¥ngshistorier

source: Have you written about your experience with Weblate â a blog post, case study, or article about your translation journey? Weâd love to feature it here! Add a link to your story and help others discover how Weblate is used in real projects around the world.
sv: Har du skrivit om dina erfarenheter av Weblate â ett blogginlÃ¤gg, en fallstudie eller en artikel om din Ã¶versÃ¤ttningsresa? Vi skulle gÃ¤rna vilja presentera det hÃ¤r! LÃ¤gg till en lÃ¤nk till din berÃ¤ttelse och hjÃ¤lp andra att upptÃ¤cka hur Weblate anvÃ¤nds i verkliga projekt runt om i vÃ¤rlden.

source: `Global Grist: How ANCT and the open-source community helped translate Grist into 20+ languages`_
sv: `Global Grist: Hur ANCT och open source-gemenskapen hjÃ¤lpte till att Ã¶versÃ¤tta Grist till Ã¶ver 20 sprÃ¥k`_

source: `Translating Open Source Software with Weblate: A GRASS GIS Case Study`_
sv: `ÃversÃ¤ttning av Ã¶ppen kÃ¤llkodsprogramvara med Weblate: En fallstudie om GRASS GIS`_

source: Localization libraries and packages
sv: Lokaliseringbibliotek och paket

source: Weblate can be integrated into your framework using :doc:`/api`. This page lists third-party libraries which integrate Weblate.
sv: Weblate kan integreras i ditt ramverk med hjÃ¤lp av :doc:`/api`. Denna sida listar tredjepartsbibliotek som integrerar Weblate.

source: `Weblate Translation Provider for Symfony Translation <https://github.com/m2mtech/weblate-translation-provider/>`_
sv: `Weblate Translation Provider fÃ¶r Symfony Translation <https://github.com/m2mtech/weblate-translation-provider/>`_

source: `Weblate plugin for Figma <https://www.figma.com/community/plugin/1053050985172660071/weblate-integration>`_
sv: `Weblate-plugin fÃ¶r Figma <https://www.figma.com/community/plugin/1053050985172660071/weblate-integration>`_

source: `WeblateFX, a JavaFX-based Weblate desktop client <https://github.com/javierllorente/weblatefx>`_
sv: `WeblateFX, en JavaFX-baserad Weblate-klient fÃ¶r skrivbordet <https://github.com/javierllorente/weblatefx>`_

source: `JWeblate, a Java-based Weblate library <https://github.com/javierllorente/jweblate>`_
sv: `JWeblate, ett Java-baserat Weblate-bibliotek <https://github.com/javierllorente/jweblate>`_

source: `Spring MessageSource backed by a Weblate server <https://github.com/porscheinformatik/weblate-spring>`_
sv: `Spring MessageSource med stÃ¶d av en Weblate-server <https://github.com/porscheinformatik/weblate-spring>`_

source: `GoLang API library for weblate <https://gitlab.com/gajdusek/goweblate>`_
sv: `GoLang API-bibliotek fÃ¶r weblate <https://gitlab.com/gajdusek/goweblate>`_

source: `Perceval backends for Weblate <https://github.com/chaoss/grimoirelab-perceval-weblate>`_
sv: `Perceval-backend fÃ¶r Weblate <https://github.com/chaoss/grimoirelab-perceval-weblate>`_

source: `Visual Studio Code Extension for Weblate <https://github.com/ianFar96/vscode-weblate-extension>`_
sv: `Visual Studio Code-tillÃ¤gg fÃ¶r Weblate <https://github.com/ianFar96/vscode-weblate-extension>`_

source: `Unofficial Weblate SDK for Flutter <https://pub.dev/packages/weblate_sdk>`_
sv: `Inofficiellt Weblate SDK fÃ¶r Flutter <https://pub.dev/packages/weblate_sdk>`_

source: Are you building a Weblate integration for your framework? Get listed here! Either submit a pull request with the changes directly or write us at care@weblate.org to get listed.
sv: HÃ¥ller du pÃ¥ att bygga en Weblate-integration fÃ¶r ditt ramverk? Registrera dig hÃ¤r! Skicka in en pull-fÃ¶rfrÃ¥gan med Ã¤ndringarna direkt eller skriv till oss pÃ¥ care@weblate.org fÃ¶r att registrera dig.

source: Managing translations
sv: Hantera Ã¶versÃ¤ttningar

source: New strings can be made available for translation when they appear in the base file, called :ref:`component-new_base` (see :ref:`component`). If your file format doesn't require such a file, as is the case with most monolingual translation flows, you can start with empty files.
sv: Nya strÃ¤ngar kan gÃ¶ras tillgÃ¤ngliga fÃ¶r Ã¶versÃ¤ttning nÃ¤r de visas i basfilen, kallad :ref:`component-new_base` (se :ref:`component`). Om ditt filformat inte krÃ¤ver en sÃ¥dan fil, vilket Ã¤r fallet med de flesta ensprÃ¥kiga Ã¶versÃ¤ttningsflÃ¶den, kan du bÃ¶rja med tomma filer.

source: Weblate can add new strings to existing files for most of the file formats. You can also specify :guilabel:`Context` for bilingual formats to distinguish same strings used in different context. :guilabel:`Auto-adjust context when an identical string already exists.` can be used to automatically adjust :guilabel:`Context` by adding a numeric suffix in case such a string already exist in the translation.
sv: Weblate kan lÃ¤gga till nya strÃ¤ngar till befintliga filer fÃ¶r de flesta filformat. Du kan ocksÃ¥ ange :guilabel:`Context` fÃ¶r tvÃ¥sprÃ¥kiga format fÃ¶r att skilja mellan samma strÃ¤ngar som anvÃ¤nds i olika sammanhang. :guilabel:`Auto-adjust context when an identical string already exists.` kan anvÃ¤ndas fÃ¶r att automatiskt justera :guilabel:`Context` genom att lÃ¤gga till ett numeriskt suffix om en sÃ¥dan strÃ¤ng redan finns i Ã¶versÃ¤ttningen.

source: Adding new translations
sv: LÃ¤gga till nya Ã¶versÃ¤ttningar

source: New languages can be added right away when requested by a user in Weblate, or a notification will be sent to project admins for approval and manual addition. This can be done using :ref:`component-new_lang` in :ref:`component`.
sv: Nya sprÃ¥k kan lÃ¤ggas till direkt nÃ¤r en anvÃ¤ndare begÃ¤r det i Weblate, eller sÃ¥ skickas en avisering till projektadministratÃ¶rerna fÃ¶r godkÃ¤nnande och manuell tillÃ¤gg. Detta kan gÃ¶ras med hjÃ¤lp av :ref:`component-new_lang` i :ref:`component`.

source: Some formats expect to start with an empty file and only translated strings to be included (for example :ref:`aresource`), while others expect to have all keys present (for example :ref:`gettext`). The document-based formats (for example :ref:`odf`) start with a copy of the source document and all strings marked as needing editing. In some situations this really doesn't depend on the format, but rather on the framework you use to handle the translation (for example with :ref:`json`).
sv: Vissa format fÃ¶rvÃ¤ntar sig att man bÃ¶rjar med en tom fil och att endast Ã¶versatta strÃ¤ngar inkluderas (till exempel :ref:`aresource`), medan andra fÃ¶rvÃ¤ntar sig att alla nycklar finns med (till exempel :ref:`gettext`). De dokumentbaserade formaten (till exempel :ref:`odf`) bÃ¶rjar med en kopia av kÃ¤lldokumentet och alla strÃ¤ngar markerade som behÃ¶ver redigeras. I vissa situationer beror detta inte pÃ¥ formatet, utan snarare pÃ¥ det ramverk du anvÃ¤nder fÃ¶r att hantera Ã¶versÃ¤ttningen (till exempel med :ref:`json`).

source: When you specify :ref:`component-new_base` in :ref:`component`, Weblate uses this file to start new translations. Any existing translations is removed from the file when doing so.
sv: NÃ¤r du anger :ref:`component-new_base` i :ref:`component` anvÃ¤nder Weblate den hÃ¤r filen fÃ¶r att starta nya Ã¶versÃ¤ttningar. Alla befintliga Ã¶versÃ¤ttningar tas bort frÃ¥n filen nÃ¤r detta gÃ¶rs.

source: When :ref:`component-new_base` is empty and the file format supports it, an empty file is created where new strings are added once they are translated.
sv: NÃ¤r :ref:`component-new_base` Ã¤r tomt och filformatet stÃ¶der det, skapas en tom fil dÃ¤r nya strÃ¤ngar lÃ¤ggs till nÃ¤r de Ã¶versÃ¤tts.

source: The :ref:`component-language_code_style` allows you to customize language code used in generated filenames. Additionally, any mappings defined in :ref:`project-language_aliases` are applied in reverse.
sv: Med :ref:`component-language_code_style` kan du anpassa sprÃ¥kkoden som anvÃ¤nds i genererade filnamn. Dessutom tillÃ¤mpas alla mappningar som definieras i :ref:`project-language_aliases` i omvÃ¤nd ordning.

source: If you add a language file in connected remote repository, respective translation is added to the component when Weblate updates local repository.
sv: Om du lÃ¤gger till en sprÃ¥kfil i ett anslutet fjÃ¤rrarkiv lÃ¤ggs motsvarande Ã¶versÃ¤ttning till komponenten nÃ¤r Weblate uppdaterar det lokala arkivet.

source: More info on the repository update settings can be found on the :ref:`update-vcs`.
sv: Mer information om instÃ¤llningarna fÃ¶r uppdatering av arkivet finns pÃ¥ :ref:`update-vcs`.

source: Removing existing translations
sv: Ta bort befintliga Ã¶versÃ¤ttningar

source: Languages, components, or the projects they are in, can be removed (deleted from Weblate and remote repository if used) from the menu :guilabel:`Operations` â :guilabel:`Removal` of each project, component, or language.
sv: SprÃ¥k, komponenter eller de projekt de ingÃ¥r i kan tas bort (raderas frÃ¥n Weblate och fjÃ¤rrarkivet om det anvÃ¤nds) frÃ¥n menyn :guilabel:`Operations` â :guilabel:`Removal` fÃ¶r varje projekt, komponent eller sprÃ¥k.

source: Initiating the :guilabel:`Removal` action shows the list of components to be removed. You have to enter the object's `slug` to confirm the removal. The `slug` is the project's, language's, or component's pathname as it can be seen in the URL.
sv: NÃ¤r du startar Ã¥tgÃ¤rden :guilabel:`Removal` visas en lista Ã¶ver komponenter som ska tas bort. Du mÃ¥ste ange objektets `slug` fÃ¶r att bekrÃ¤fta borttagningen. `Slug` Ã¤r projektets, sprÃ¥kets eller komponentens sÃ¶kvÃ¤g som den visas i URL:en.

source: If you want to remove just some specific strings, there are following ways:
sv: Om du bara vill ta bort vissa specifika strÃ¤ngar finns fÃ¶ljande sÃ¤tt:

source: Manually in the source file. They will be removed from the translation project as well upon Weblate's repository update.
sv: Manuellt i kÃ¤llfilen. De kommer ocksÃ¥ att tas bort frÃ¥n Ã¶versÃ¤ttningsprojektet nÃ¤r Weblates arkiv uppdateras.

source: In Weblateâs UI via button :guilabel:`Operations` â :guilabel:`Remove` while editing the string. This has differences between file formats, see: :ref:`component-manage_units`
sv: I Weblates anvÃ¤ndargrÃ¤nssnitt via knappen :guilabel:`Operations` â :guilabel:`Remove` medan du redigerar strÃ¤ngen. Detta skiljer sig Ã¥t mellan olika filformat, se: :ref:`component-manage_units`

source: If you delete a language file in connected remote repository, respective translation will be removed from the component when Weblate updates local repository.
sv: Om du tar bort en sprÃ¥kfil i ett anslutet fjÃ¤rrarkiv kommer motsvarande Ã¶versÃ¤ttning att tas bort frÃ¥n komponenten nÃ¤r Weblate uppdaterar det lokala arkivet.

source: String variants
sv: StrÃ¤ngvarianter

source: Variants are useful to group several strings together so that translators can see all variants of the string at one place.
sv: Variant Ã¤r anvÃ¤ndbara fÃ¶r att gruppera flera strÃ¤ngar sÃ¥ att Ã¶versÃ¤ttare kan se alla varianter av strÃ¤ngen pÃ¥ ett stÃ¤lle.

source: Abbreviations (shortened forms, contractions) are a good example of variants.
sv: FÃ¶rkortningar (fÃ¶rkortade former, sammandragningar) Ã¤r ett bra exempel pÃ¥ varianter.

source: Automated key based variants
sv: Automatiserade nyckelbaserade varianter

source: You can define regular expression to group the strings based on the key of monolingual translations in the :ref:`component`:
sv: Du kan definiera reguljÃ¤ra uttryck fÃ¶r att gruppera strÃ¤ngarna baserat pÃ¥ nyckeln fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar i :ref:`component`:

source: In case the :guilabel:`Key` matches the expression, the matching part is removed to generate root key of the variant. Then all the strings with the same root key become part of a single variant group, also including the string with the key exactly matching the root key.
sv: Om :guilabel:`Key` matchar uttrycket tas den matchande delen bort fÃ¶r att generera variantens rotnyckel. DÃ¤refter blir alla strÃ¤ngar med samma rotnyckel en del av en enda variantgrupp, inklusive strÃ¤ngen med nyckeln som exakt matchar rotnyckeln.

source: The following table lists some usage examples:
sv: FÃ¶ljande tabell visar nÃ¥gra anvÃ¤ndningsexempel:

source: Regular expression variant
sv: Variant av reguljÃ¤rt uttryck

source: Matched translation keys
sv: Matchade Ã¶versÃ¤ttningsnycklar

source: Suffix identification
sv: Suffixidentifiering

source: Inline identification
sv: Inline-identifiering

source: Manual variants
sv: Manuella varianter

source: You can manually link specific strings using ``variant:SOURCE`` flag. This can be useful for bilingual translations which do not have keys to group strings automatically, or to group strings which keys are not matching, but should be considered together when translating.
sv: Du kan manuellt lÃ¤nka specifika strÃ¤ngar med flaggan ``variant:SOURCE``. Detta kan vara anvÃ¤ndbart fÃ¶r tvÃ¥sprÃ¥kiga Ã¶versÃ¤ttningar som inte har nycklar fÃ¶r att automatiskt gruppera strÃ¤ngar, eller fÃ¶r att gruppera strÃ¤ngar vars nycklar inte matchar, men som bÃ¶r betraktas tillsammans vid Ã¶versÃ¤ttning.

source: The additional variant for a string can also be added using the :guilabel:`Tools` while translating (when :ref:`component-manage_units` is turned on):
sv: Den extra varianten fÃ¶r en strÃ¤ng kan ocksÃ¥ lÃ¤ggas till med hjÃ¤lp av :guilabel:`Verktyg` under Ã¶versÃ¤ttningen (nÃ¤r :ref:`component-manage_units` Ã¤r aktiverat):

source: The variant source string has to be at most 768 characters long. This is a technical limitation due to compatibility with MySQL database.
sv: VariantkÃ¤llstrÃ¤ngen fÃ¥r vara hÃ¶gst 768 tecken lÃ¥ng. Detta Ã¤r en teknisk begrÃ¤nsning pÃ¥ grund av kompatibilitet med MySQL-databasen.

source: Variants while translating
sv: Variationer vid Ã¶versÃ¤ttning

source: The variant is later grouped when translating:
sv: Varianten grupperas senare vid Ã¶versÃ¤ttningen:

source: String labels
sv: StrÃ¤ngetiketter

source: Split component translation strings into categories by text and colour in the project configuration.
sv: Dela upp Ã¶versÃ¤ttningsstrÃ¤ngar i kategorier efter text och fÃ¤rg i projektkonfigurationen.

source: Labels can be assigned to units in :ref:`additional` by bulk editing, or using the :ref:`addon-weblate.flags.bulk` add-on.
sv: Etiketter kan tilldelas enheter i :ref:`additional` genom massredigering eller med hjÃ¤lp av tillÃ¤gget :ref:`addon-weblate.flags.bulk`.

source: How to create an automated workflow?
sv: Hur skapar man ett automatiserat arbetsflÃ¶de?

source: Weblate can handle all the translation things semi-automatically for you. If you give it push access to your repository, the translations can happen without interaction, unless some merge conflict occurs.
sv: Weblate kan hantera alla Ã¶versÃ¤ttningsuppgifter halvautomatiskt Ã¥t dig. Om du ger det push-Ã¥tkomst till ditt arkiv kan Ã¶versÃ¤ttningarna ske utan interaktion, sÃ¥vida inte nÃ¥gon sammanfogningskonflikt uppstÃ¥r.

source: Set up your Git repository to tell Weblate when there is any change, see :ref:`hooks` for info on how to do it.
sv: Konfigurera ditt Git-arkiv sÃ¥ att det meddelar Weblate nÃ¤r det sker nÃ¥gon fÃ¶rÃ¤ndring. Se :ref:`hooks` fÃ¶r information om hur du gÃ¶r det.

source: Set a push URL at your :ref:`component` in Weblate, this allows Weblate to push changes to your repository.
sv: Ange en push-URL i din :ref:`component` i Weblate, sÃ¥ att Weblate kan Ã¶verfÃ¶ra Ã¤ndringar till ditt arkiv.

source: Turn on :ref:`component-push_on_commit` on your :ref:`component` in Weblate, this will make Weblate push changes to your repository whenever they happen at Weblate.
sv: Aktivera :ref:`component-push_on_commit` pÃ¥ din :ref:`component` i Weblate. Detta gÃ¶r att Weblate skickar Ã¤ndringar till ditt arkiv sÃ¥ fort de gÃ¶rs i Weblate.

source: How to access repositories over SSH?
sv: Hur fÃ¥r man Ã¥tkomst till arkiv via SSH?

source: Please see :ref:`vcs-repos` for info on setting up SSH keys.
sv: Se :ref:`vcs-repos` fÃ¶r information om hur du konfigurerar SSH-nycklar.

source: How to fix merge conflicts in translations?
sv: Hur Ã¥tgÃ¤rdar man sammanfogningskonflikter i Ã¶versÃ¤ttningar?

source: Merge conflicts happen from time to time when the translation file is changed in both Weblate and the upstream repository concurrently. You can usually avoid this by merging Weblate translations prior to making changes in the translation files (e.g. before running msgmerge). Just tell Weblate to commit all pending translations (you can do it in :guilabel:`Repository maintenance` in the :guilabel:`Operations` menu) and merge the repository (if automatic push is not on).
sv: Konflikter uppstÃ¥r ibland nÃ¤r Ã¶versÃ¤ttningsfilen Ã¤ndras samtidigt i bÃ¥de Weblate och uppstrÃ¶msrepositoriet. Du kan vanligtvis undvika detta genom att slÃ¥ samman Weblate-Ã¶versÃ¤ttningar innan du gÃ¶r Ã¤ndringar i Ã¶versÃ¤ttningsfilerna (t.ex. innan du kÃ¶r msgmerge). Be bara Weblate att bekrÃ¤fta alla vÃ¤ntande Ã¶versÃ¤ttningar (du kan gÃ¶ra det i :guilabel:`Repository maintenance` i menyn :guilabel:`Operations`) och slÃ¥ samman arkivet (om automatisk push inte Ã¤r aktiverad).

source: If you've already encountered a merge conflict, the easiest way to solve all conflicts locally on your machine, is to add Weblate as a remote repository, merge it into upstream and fix any conflicts. Once you push changes back, Weblate will be able to use the merged version without any other special actions.
sv: Om du redan har stÃ¶tt pÃ¥ en sammanfogningskonflikt Ã¤r det enklaste sÃ¤ttet att lÃ¶sa alla konflikter lokalt pÃ¥ din dator att lÃ¤gga till Weblate som ett fjÃ¤rrarkiv, sammanfoga det i uppstrÃ¶ms och Ã¥tgÃ¤rda eventuella konflikter. NÃ¤r du har skickat tillbaka Ã¤ndringarna kommer Weblate att kunna anvÃ¤nda den sammanfogade versionen utan nÃ¥gra andra sÃ¤rskilda Ã¥tgÃ¤rder.

source: Depending on your setup, access to the Weblate repository might require authentication. When using the built-in :ref:`git-exporter` in Weblate, you authenticate with your username and the API key.
sv: Beroende pÃ¥ din konfiguration kan Ã¥tkomst till Weblate-arkivet krÃ¤va autentisering. NÃ¤r du anvÃ¤nder den inbyggda :ref:`git-exporter` i Weblate autentiserar du dig med ditt anvÃ¤ndarnamn och API-nyckeln.

source: If you're using multiple branches in Weblate, you can do the same to all of them:
sv: Om du anvÃ¤nder flera grenar i Weblate kan du gÃ¶ra samma sak med alla:

source: In case of gettext PO files, there is a way to merge conflicts in a semi-automatic way:
sv: NÃ¤r det gÃ¤ller gettext PO-filer finns det ett sÃ¤tt att slÃ¥ samman konflikter pÃ¥ ett halvautomatiskt sÃ¤tt:

source: Fetch and keep a local clone of the Weblate Git repository. Also get a second fresh local clone of the upstream Git repository (i. e. you need two copies of the upstream Git repository: An intact and a working copy):
sv: HÃ¤mta och spara en lokal klon av Weblate Git-arkivet. HÃ¤mta ocksÃ¥ en andra ny lokal klon av uppstrÃ¶ms Git-arkivet (dvs. du behÃ¶ver tvÃ¥ kopior av uppstrÃ¶ms Git-arkivet: en intakt och en fungerande kopia):

source: How do I translate several branches at once?
sv: Hur Ã¶versÃ¤tter jag flera grenar samtidigt?

source: Weblate supports pushing translation changes within one :ref:`project`. For every :ref:`component` which has it turned on (the default behavior), the change made is automatically propagated to others. This way translations are kept synchronized even if the branches themselves have already diverged quite a lot, and it is not possible to simply merge translation changes between them.
sv: Weblate stÃ¶der Ã¶verfÃ¶ring av Ã¶versÃ¤ttningsÃ¤ndringar inom ett :ref:`project`. FÃ¶r varje :ref:`component` dÃ¤r funktionen Ã¤r aktiverad (standardinstÃ¤llning) Ã¶verfÃ¶rs Ã¤ndringen automatiskt till andra komponenter. PÃ¥ sÃ¥ sÃ¤tt hÃ¥lls Ã¶versÃ¤ttningarna synkroniserade Ã¤ven om grenarna i sig redan har divergerat ganska mycket och det inte Ã¤r mÃ¶jligt att helt enkelt slÃ¥ samman Ã¶versÃ¤ttningsÃ¤ndringarna mellan dem.

source: Once you merge changes from Weblate, you might have to merge these branches (depending on your development workflow) discarding differences:
sv: NÃ¤r du har sammanfÃ¶rt Ã¤ndringarna frÃ¥n Weblate kan du behÃ¶va sammanfÃ¶ra dessa grenar (beroende pÃ¥ ditt utvecklingsflÃ¶de) och kasta bort skillnaderna:

source: How to translate multi-platform projects?
sv: Hur Ã¶versÃ¤tter man projekt fÃ¶r flera plattformar?

source: Weblate supports a wide range of file formats (see :doc:`formats`) and the easiest approach is to use the native format for each platform.
sv: Weblate stÃ¶der ett brett utbud av filformat (se :doc:`formats`) och det enklaste sÃ¤ttet Ã¤r att anvÃ¤nda det inbyggda formatet fÃ¶r varje plattform.

source: Once you have added all platform translation files as components in one project (see :ref:`adding-projects`), you can utilize the translation propagation feature (turned on by default, and can be turned off in the :ref:`component`) to translate strings for all platforms at once.
sv: NÃ¤r du har lagt till alla plattformsÃ¶versÃ¤ttningsfiler som komponenter i ett projekt (se :ref:`adding-projects`) kan du anvÃ¤nda funktionen fÃ¶r Ã¶versÃ¤ttningsspridning (aktiverad som standard, kan inaktiveras i :ref:`component`) fÃ¶r att Ã¶versÃ¤tta strÃ¤ngar fÃ¶r alla plattformar samtidigt.

source: How to export the Git repository that Weblate uses?
sv: Hur exporterar man Git-arkivet som Weblate anvÃ¤nder?

source: There is nothing special about the repository, it lives under the :setting:`DATA_DIR` directory and is named :file:`vcs/<project>/<component>/`. If you have SSH access to this machine, you can use the repository directly.
sv: Det finns inget speciellt med arkivet, det finns under katalogen :setting:`DATA_DIR` och heter :file:`vcs/<project>/<component>/`. Om du har SSH-Ã¥tkomst till den hÃ¤r maskinen kan du anvÃ¤nda arkivet direkt.

source: For anonymous access, you might want to run a Git server and let it serve the repository to the outside world.
sv: FÃ¶r anonym Ã¥tkomst kan du kÃ¶ra en Git-server och lÃ¥ta den tillhandahÃ¥lla arkivet till omvÃ¤rlden.

source: Alternatively, you can use :ref:`git-exporter` inside Weblate to automate this.
sv: Alternativt kan du anvÃ¤nda :ref:`git-exporter` i Weblate fÃ¶r att automatisera detta.

source: What are the options for pushing changes back upstream?
sv: Vilka alternativ finns fÃ¶r att skicka tillbaka Ã¤ndringar uppstrÃ¶ms?

source: This heavily depends on your setup, Weblate is quite flexible in this area. Here are examples of some workflows used with Weblate:
sv: Detta beror i hÃ¶g grad pÃ¥ din konfiguration, Weblate Ã¤r ganska flexibelt pÃ¥ detta omrÃ¥de. HÃ¤r Ã¤r nÃ¥gra exempel pÃ¥ arbetsflÃ¶den som anvÃ¤nds med Weblate:

source: Weblate automatically pushes and merges changes (see :ref:`auto-workflow`).
sv: Weblate Ã¶verfÃ¶r och sammanfogar Ã¤ndringar automatiskt (se :ref:`auto-workflow`).

source: You manually tell Weblate to push (it needs push access to the upstream repository).
sv: Du ber Weblate manuellt att pusha (det krÃ¤vs push-Ã¥tkomst till uppstrÃ¶msrepositoriet).
